## staging: lambda-api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 7 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                    NAME                                     |
|----------|-----------------------------------------------------------------------------|
| add      | `aws_cloudwatch_metric_alarm.api-gateway-5xx-error-critical[0]`             |
|          | `aws_cloudwatch_metric_alarm.lambda-api-throttle-critical[0]`               |
|          | `aws_cloudwatch_query_definition.api_gateway_average_latency[0]`            |
|          | `aws_cloudwatch_query_definition.api_gateway_errors_by_ip_address[0]`       |
|          | `aws_cloudwatch_query_definition.api_lambda_concurrent_running_per_min[0]`  |
|          | `aws_cloudwatch_query_definition.api_lambda_gunicorn_total_running_time[0]` |
| recreate | `null_resource.api_gateway_cloudwatch_logging[0]`                           |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
19:28:48.062 STDOUT terraform:   + create
19:28:48.062 STDOUT terraform: -/+ destroy and then create replacement
19:28:48.062 STDOUT terraform: Terraform will perform the following actions:
19:28:48.062 STDOUT terraform:   # aws_cloudwatch_metric_alarm.api-gateway-5xx-error-critical[0] will be created
19:28:48.062 STDOUT terraform:   + resource "aws_cloudwatch_metric_alarm" "api-gateway-5xx-error-critical" {
19:28:48.062 STDOUT terraform:       + actions_enabled                       = true
19:28:48.062 STDOUT terraform:       + alarm_actions                         = [
19:28:48.062 STDOUT terraform:           + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
19:28:48.063 STDOUT terraform:         ]
19:28:48.063 STDOUT terraform:       + alarm_description                     = "API Gateway is returning 5XX errors"
19:28:48.063 STDOUT terraform:       + alarm_name                            = "api-gateway-5xx-error-critical"
19:28:48.063 STDOUT terraform:       + arn                                   = (known after apply)
19:28:48.063 STDOUT terraform:       + comparison_operator                   = "GreaterThanThreshold"
19:28:48.063 STDOUT terraform:       + dimensions                            = {
19:28:48.063 STDOUT terraform:           + "ApiName" = "api-lambda"
19:28:48.063 STDOUT terraform:           + "Stage"   = "v1"
19:28:48.063 STDOUT terraform:         }
19:28:48.063 STDOUT terraform:       + evaluate_low_sample_count_percentiles = (known after apply)
19:28:48.063 STDOUT terraform:       + evaluation_periods                    = 1
19:28:48.063 STDOUT terraform:       + id                                    = (known after apply)
19:28:48.063 STDOUT terraform:       + insufficient_data_actions             = [
19:28:48.063 STDOUT terraform:           + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
19:28:48.063 STDOUT terraform:         ]
19:28:48.063 STDOUT terraform:       + metric_name                           = "5XXError"
19:28:48.063 STDOUT terraform:       + namespace                             = "AWS/ApiGateway"
19:28:48.063 STDOUT terraform:       + ok_actions                            = [
19:28:48.063 STDOUT terraform:           + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
19:28:48.063 STDOUT terraform:         ]
19:28:48.063 STDOUT terraform:       + period                                = 60
19:28:48.063 STDOUT terraform:       + region                                = "ca-central-1"
19:28:48.063 STDOUT terraform:       + statistic                             = "Sum"
19:28:48.064 STDOUT terraform:       + tags_all                              = (known after apply)
19:28:48.064 STDOUT terraform:       + threshold                             = 10
19:28:48.064 STDOUT terraform:       + treat_missing_data                    = "notBreaching"
19:28:48.064 STDOUT terraform:     }
19:28:48.064 STDOUT terraform:   # aws_cloudwatch_metric_alarm.lambda-api-throttle-critical[0] will be created
19:28:48.064 STDOUT terraform:   + resource "aws_cloudwatch_metric_alarm" "lambda-api-throttle-critical" {
19:28:48.064 STDOUT terraform:       + actions_enabled                       = true
19:28:48.064 STDOUT terraform:       + alarm_actions                         = [
19:28:48.064 STDOUT terraform:           + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
19:28:48.064 STDOUT terraform:         ]
19:28:48.064 STDOUT terraform:       + alarm_description                     = "API Lambda function is being throttled"
19:28:48.064 STDOUT terraform:       + alarm_name                            = "lambda-api-throttle-critical"
19:28:48.064 STDOUT terraform:       + arn                                   = (known after apply)
19:28:48.064 STDOUT terraform:       + comparison_operator                   = "GreaterThanThreshold"
19:28:48.064 STDOUT terraform:       + dimensions                            = {
19:28:48.064 STDOUT terraform:           + "FunctionName" = "api-lambda"
19:28:48.064 STDOUT terraform:         }
19:28:48.064 STDOUT terraform:       + evaluate_low_sample_count_percentiles = (known after apply)
19:28:48.064 STDOUT terraform:       + evaluation_periods                    = 1
19:28:48.064 STDOUT terraform:       + id                                    = (known after apply)
19:28:48.064 STDOUT terraform:       + insufficient_data_actions             = [
19:28:48.064 STDOUT terraform:           + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
19:28:48.064 STDOUT terraform:         ]
19:28:48.064 STDOUT terraform:       + metric_name                           = "Throttles"
19:28:48.064 STDOUT terraform:       + namespace                             = "AWS/Lambda"
19:28:48.064 STDOUT terraform:       + ok_actions                            = [
19:28:48.064 STDOUT terraform:           + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
19:28:48.065 STDOUT terraform:         ]
19:28:48.065 STDOUT terraform:       + period                                = 60
19:28:48.065 STDOUT terraform:       + region                                = "ca-central-1"
19:28:48.065 STDOUT terraform:       + statistic                             = "Sum"
19:28:48.065 STDOUT terraform:       + tags_all                              = (known after apply)
19:28:48.065 STDOUT terraform:       + threshold                             = 10
19:28:48.065 STDOUT terraform:       + treat_missing_data                    = "notBreaching"
19:28:48.065 STDOUT terraform:     }
19:28:48.065 STDOUT terraform:   # aws_cloudwatch_query_definition.api_gateway_average_latency[0] will be created
19:28:48.065 STDOUT terraform:   + resource "aws_cloudwatch_query_definition" "api_gateway_average_latency" {
19:28:48.065 STDOUT terraform:       + id                  = (known after apply)
19:28:48.065 STDOUT terraform:       + log_group_names     = [
19:28:48.065 STDOUT terraform:           + "api_gateway_log_group",
19:28:48.065 STDOUT terraform:         ]
19:28:48.065 STDOUT terraform:       + name                = "Average Latency from API Gateway"
19:28:48.065 STDOUT terraform:       + query_definition_id = (known after apply)
19:28:48.065 STDOUT terraform:       + query_string        = <<-EOT
19:28:48.065 STDOUT terraform:             fields @timestamp, @message
19:28:48.065 STDOUT terraform:             | parse @message '"resourcePath":"*"' as resourcePath
19:28:48.065 STDOUT terraform:             | parse @message '"responseLatency":"*"' as responseLatency
19:28:48.065 STDOUT terraform:             | stats 
19:28:48.065 STDOUT terraform:                 count() as requests,
19:28:48.065 STDOUT terraform:                 avg(responseLatency) as avgLatency,
19:28:48.065 STDOUT terraform:                 pct(responseLatency, 95) as p95Latency,
19:28:48.065 STDOUT terraform:                 max(responseLatency) as maxLatency
19:28:48.065 STDOUT terraform:                 by resourcePath,
19:28:48.065 STDOUT terraform:                    if(responseLatency < 400, "under 400ms",
19:28:48.065 STDOUT terraform:                       if(responseLatency < 1000, "400ms - 1s", "over 1s")
19:28:48.065 STDOUT terraform:                    ) as latencyBucket
19:28:48.065 STDOUT terraform:             | sort avgLatency desc
19:28:48.065 STDOUT terraform:         EOT
19:28:48.065 STDOUT terraform:       + region              = "ca-central-1"
19:28:48.066 STDOUT terraform:     }
19:28:48.066 STDOUT terraform:   # aws_cloudwatch_query_definition.api_gateway_errors_by_ip_address[0] will be created
19:28:48.066 STDOUT terraform:   + resource "aws_cloudwatch_query_definition" "api_gateway_errors_by_ip_address" {
19:28:48.066 STDOUT terraform:       + id                  = (known after apply)
19:28:48.066 STDOUT terraform:       + log_group_names     = [
19:28:48.066 STDOUT terraform:           + "api_gateway_log_group",
19:28:48.066 STDOUT terraform:         ]
19:28:48.066 STDOUT terraform:       + name                = "API Gateway error by IP address"
19:28:48.066 STDOUT terraform:       + query_definition_id = (known after apply)
19:28:48.066 STDOUT terraform:       + query_string        = <<-EOT
19:28:48.066 STDOUT terraform:             fields @timestamp, @message, @logStream, status
19:28:48.066 STDOUT terraform:             | filter status = "500"
19:28:48.066 STDOUT terraform:             | stats count() as total by ip
19:28:48.066 STDOUT terraform:             | order by total desc
19:28:48.066 STDOUT terraform:             | limit 1000
19:28:48.066 STDOUT terraform:         EOT
19:28:48.066 STDOUT terraform:       + region              = "ca-central-1"
19:28:48.066 STDOUT terraform:     }
19:28:48.066 STDOUT terraform:   # aws_cloudwatch_query_definition.api_lambda_concurrent_running_per_min[0] will be created
19:28:48.066 STDOUT terraform:   + resource "aws_cloudwatch_query_definition" "api_lambda_concurrent_running_per_min" {
19:28:48.066 STDOUT terraform:       + id                  = (known after apply)
19:28:48.066 STDOUT terraform:       + log_group_names     = [
19:28:48.066 STDOUT terraform:           + "/aws/lambda/api-lambda",
19:28:48.066 STDOUT terraform:         ]
19:28:48.066 STDOUT terraform:       + name                = "API / Concurrent API-Lambdas running per min"
19:28:48.066 STDOUT terraform:       + query_definition_id = (known after apply)
19:28:48.066 STDOUT terraform:       + query_string        = <<-EOT
19:28:48.066 STDOUT terraform:             fields @timestamp, @message
19:28:48.066 STDOUT terraform:             | parse @message /START RequestId: (?<requestId>[\w-]+)/
19:28:48.066 STDOUT terraform:             | stats count() as concurrent by bin(1m)
19:28:48.066 STDOUT terraform:             | sort concurrent desc
19:28:48.066 STDOUT terraform:         EOT
19:28:48.066 STDOUT terraform:       + region              = "ca-central-1"
19:28:48.066 STDOUT terraform:     }
19:28:48.066 STDOUT terraform:   # aws_cloudwatch_query_definition.api_lambda_gunicorn_total_running_time[0] will be created
19:28:48.066 STDOUT terraform:   + resource "aws_cloudwatch_query_definition" "api_lambda_gunicorn_total_running_time" {
19:28:48.066 STDOUT terraform:       + id                  = (known after apply)
19:28:48.066 STDOUT terraform:       + log_group_names     = [
19:28:48.067 STDOUT terraform:           + "/aws/lambda/api-lambda",
19:28:48.067 STDOUT terraform:         ]
19:28:48.067 STDOUT terraform:       + name                = "API / Gunicorn total running time"
19:28:48.067 STDOUT terraform:       + query_definition_id = (known after apply)
19:28:48.067 STDOUT terraform:       + query_string        = <<-EOT
19:28:48.067 STDOUT terraform:             filter @message like /Total gunicorn running time/
19:28:48.067 STDOUT terraform:             | parse @message /Total gunicorn API running time: (?<@gunicorn_time>.*?) seconds/
19:28:48.067 STDOUT terraform:             | order by @timestamp asc
19:28:48.067 STDOUT terraform:             | display @timestamp, @gunicorn_time
19:28:48.067 STDOUT terraform:         EOT
19:28:48.067 STDOUT terraform:       + region              = "ca-central-1"
19:28:48.067 STDOUT terraform:     }
19:28:48.067 STDOUT terraform:   # null_resource.api_gateway_cloudwatch_logging[0] must be replaced
19:28:48.067 STDOUT terraform: -/+ resource "null_resource" "api_gateway_cloudwatch_logging" {
19:28:48.067 STDOUT terraform:       ~ id       = "362590925745581159" -> (known after apply)
19:28:48.067 STDOUT terraform:       ~ triggers = { # forces replacement
19:28:48.067 STDOUT terraform:           ~ "always_run" = "2025-08-26T17:56:47Z" -> (known after apply)
19:28:48.067 STDOUT terraform:         }
19:28:48.067 STDOUT terraform:     }
19:28:48.067 STDOUT terraform: Plan: 7 to add, 0 to change, 1 to destroy.
19:28:48.067 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
19:28:48.067 STDOUT terraform: Saved the plan to: plan.tfplan
19:28:48.067 STDOUT terraform: To perform exactly these actions, run the following command to apply:
19:28:48.067 STDOUT terraform:     terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.alt_api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_stage.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_appautoscaling_target.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_gateway_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_lambda_log_group[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-5xx-error-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-5xx-error-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-timeout-5-minute-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-timeout-5-minute-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.failed-login-count-5-minute-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-api-throttle-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-api-throttle-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-lambda-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-salesforce-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-error-5-minutes-critical-lambda-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.api"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
